posts/copied/20250607-4chan_forMyAnons_pack.org
#+title: Self-Improvement Advises from 4Chan
#+startup: content

#+begin_quote
| ~󰎚~

This content was transcribed from the images present on a 4Chan curated pack.

*Enjoy in being a better version of yourself!*
#+end_quote

* 10 Personal Finances Tips
# Sun Jan 21 04:50:16 2024
1. Spend less than you earn.
2. Build multiple streams of income.
3. Pay down the highest interest bearing debt first.
4. Income does not determine wealth.
5. Do everything in moderation.
6. Know the difference between good debt and bad debt.
7. Develop a Workable Household Budget.
8. Track your income and expenses.
9. Never assume past performance guarantees future results.
10. Pay the bills on time. By doing so you'll avoid spending money on needless late fees.
* The 3 Types of People To Surround Yourself With
- *The Dreamer:* It’s important to have someone who always thinks positive and keeps you believing!
- *The Hardworker:* You need someone who will keep pushing your work ethic to new heights into actions
- *The Realist:* This person will keep you level-headed and make sure your thinking deeper ...
* 5 LEARNABLE MINDSETS OF SUCCESSFUL PEOPLE
1. Successful people know and accept themselves.
2. Successful people set goals congruent with their personality, values, interests, strengths, skills, mission and purpose.
3. Successful people know they have much more control over the trajectory of their lives than others realize.
4. Successful people accept that they will repeatedly go through tough times.
5. Successful people know that once they get to their destination, they will find another.
* 9 THINGS TO DO IN YOUR 20S TO BECOME A MILLIONAIRE BY 30
1. Focus on earning.
2. Develop multiple streams of income
3. Save to invest, don't save to save.
4. Don't show off - show up.
5. Change your mindset about money.
6. Invest in yourself.
7. Set goals and visualize achieving them.
8. Start hanging out with people you admire.
9. Shoot for $10 million, not $1 million.
* tips_for_a_successful_life
*Millionaire's rules you will never learn in school*
- *You will not make six figure salary after school:* You will have to work hard for what you get
- *Your parents know something you don't:* Perhaps, before you were born, your parents weren't as boring as they are now
- *Life is not fair. Get used to It:* Stop expecting life to hand you the things you think you "deserve"
- *"Flipping Burgers" is not beneath your dignity:* Swallow your pride and take that job you think is beneath you as stepping stone
- *Your school may have done away with winners and losers but life has not:* The result of an exam does not justify the means. It doesn't bear the slightest resemblance to anything in real life
- *The world doesn't care about your self esteem*
- *If you mess up, it's not your parents fault:* Stop spreading the blame around and take responsibility for your failures
- *Life is not divided into semesters:* Once life starts, it just goes on and on. So spend your time doing something worthwhile
* WHY BECOMING RICH QUICK IS DANGEROUS
Did you know that many lottery winners go broke after a couple of years?
1. If you don’t work your ass off for your money you will not understand the real value of it
2. Money that comes fast gets spent fast
3. Many people who get rich quick or by luck stop spending it logically and start spending emotionally
4. You need a certain financial education in order to invest your money in a correct and clever way
5. Remember that you can always fall way faster than you climbed to the top

Being broke can teach you the most valuable lessons in life which spoiled rich kids will never understand.
That’s why I’m grateful for the fact that I failed so badly before I started making real money.
* great_minds_discuss_ideas
- *Great minds discuss ideas:* philosophy science happiness epistomology psychology art creativity knowledge self spirituality improvement solutions abstraction music relationships peace
- *Average minds discuss events:* news weather politics religion television sales sports work concerts activities plans
- *Small minds discuss people:* gossip drama politicians peers clergymen leaders neighbors friends family coworkers
* Invest in yourself
- Quit a habit
- Work out
- Meditate
- Self-reflect
- Learn a new skill
- Read
