copied/20250607-4chan_forMyAnons_pack.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Self-Improvement Advises from 4Chan</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/theme/style.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
  <h1><a href="/">thisago's blog</a></h1>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Self-Improvement Advises from 4Chan</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org65f3ed6">10 Personal Finances Tips</a></li>
<li><a href="#orgc947a17">The 3 Types of People To Surround Yourself With</a></li>
<li><a href="#org558ea8d">5 LEARNABLE MINDSETS OF SUCCESSFUL PEOPLE</a></li>
<li><a href="#org969079d">9 THINGS TO DO IN YOUR 20S TO BECOME A MILLIONAIRE BY 30</a></li>
<li><a href="#orgd47600c">tips<sub>for</sub><sub>a</sub><sub>successful</sub><sub>life</sub></a></li>
<li><a href="#org08db871">WHY BECOMING RICH QUICK IS DANGEROUS</a></li>
<li><a href="#org0f4aebb">great<sub>minds</sub><sub>discuss</sub><sub>ideas</sub></a></li>
<li><a href="#orgb815694">Invest in yourself</a></li>
<li><a href="#orgcd184ce">LACK PEOPLE WITH DREAMS</a></li>
<li><a href="#org9a719ae">RICH POOR VS POOR PEOPLE</a></li>
<li><a href="#orgfcef08f">Right environment</a></li>
<li><a href="#orga98ac62">Spend your time wisely</a></li>
<li><a href="#orgf8a67fd">Successful vs Unsuccessful People</a>
<ul>
<li><a href="#org3c5589d">SUCCESSFUL PEOPLE</a></li>
<li><a href="#org48f18b4">UNSUCCESSFUL PEOPLE</a></li>
</ul>
</li>
<li><a href="#org9355482">Surround yourself with good people</a></li>
<li><a href="#org495f649">Successful vs Unsuccessful People</a>
<ul>
<li><a href="#org673732b">SUCCESSFUL PEOPLE</a></li>
<li><a href="#org2499a26">UNSUCCESSFUL PEOPLE</a></li>
</ul>
</li>
<li><a href="#org7e2c203">Little chickens</a></li>
<li><a href="#org53356f2">Make money: The startup way</a></li>
<li><a href="#org729b2d2">You need 3 hobbies</a></li>
<li><a href="#orgbf68231">10 simple rules for self-improvement</a></li>
<li><a href="#org2ca8620">10 things that require zero talent</a></li>
<li><a href="#org1358118">19 Habits to live by</a></li>
<li><a href="#org372053b">Three simple rules in life</a></li>
<li><a href="#org1b8a482">4 Ways to invest your time wisely</a></li>
<li><a href="#orgf4e36ba">Adopt the mindset</a>
<ul>
<li><a href="#org4bebfbe">Practice Mindfulness Meditation</a></li>
<li><a href="#org6e7416e">Stay In The Present Moment</a></li>
<li><a href="#orgbe7117d">Set Goals</a>
<ul>
<li><a href="#org12c8ede">Improve Your "Stuff"</a></li>
<li><a href="#org374904a">Improve Your Fitness Level</a></li>
<li><a href="#orgad200ec">Improve Mental Health</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8cb444b">Allow things to pass</a></li>
<li><a href="#org3d1b9d4">Confort is a drug</a></li>
<li><a href="#orgd78b68a">Do not try to change the world</a></li>
<li><a href="#orgceffe85">Five Things Mentally Strong People Do</a></li>
<li><a href="#org0a5095d">Great minds</a></li>
<li><a href="#org540ddfb">Growth and Fixed Mindset</a>
<ul>
<li><a href="#orgb749da3">Growth Mindset</a></li>
<li><a href="#org007c5ff">Fixed Mindset</a></li>
</ul>
</li>
<li><a href="#org4c6b17e">Inferior and Superior Man</a></li>
<li><a href="#org00e5e0a">Learn How To&#x2026;</a></li>
<li><a href="#org07ee281">Lions don't roar</a></li>
<li><a href="#org44296cf">Do Not associate With The Ignorant</a></li>
<li><a href="#org39c3633">FAILURE</a></li>
<li><a href="#orgba11d6a">Spend on interior</a></li>
<li><a href="#org5639d91">Be consistent</a></li>
<li><a href="#org11a8e1d">You in 5 Years</a></li>
<li><a href="#org8118a2b">THE TWO SPIRITUAL CURRENCIES</a></li>
<li><a href="#orgcd8236d">29 ways to stay creative</a></li>
<li><a href="#org3d3fc1d">FRIENDS</a></li>
<li><a href="#org2d4abd8">TO DO</a></li>
<li><a href="#org1714fb5">Educate yourself</a></li>
<li><a href="#org3af2971">Unhelpful thinking styles</a>
<ul>
<li><a href="#org17ead50">All or nothing thinking</a></li>
<li><a href="#org7f27ef6">Mental filter</a></li>
<li><a href="#org655cd0c">Jumping to conclusions</a></li>
<li><a href="#org86d7216">Emotional reasoning</a></li>
<li><a href="#org0d8a442">Labeling</a></li>
<li><a href="#org9080c01">Over-generalizing</a></li>
<li><a href="#org6edff48">Disqualifying the positive</a></li>
<li><a href="#org2630c35">Magnification (catastrophising) and Minimization</a></li>
<li><a href="#org4dfdbdb">Should, must&#x2026;</a></li>
<li><a href="#org1286538">"This is my fault"</a></li>
</ul>
</li>
<li><a href="#org47a45f4">Why Only Few Succeed</a></li>
<li><a href="#orgbc5c2e9">Why People Give Up</a></li>
<li><a href="#orgd3838db">Maybe not from 4Chan</a>
<ul>
<li><a href="#org6cc8c18">VERDADES QUE VOCE NAO QUER LER</a></li>
<li><a href="#org7dbd02a">ENTENDENDO SUAS HABILIDADES</a>
<ul>
<li><a href="#org97de5da">Aprecie seu esforço.</a></li>
<li><a href="#org6f008d9">Anote o que você faz</a></li>
<li><a href="#org3eb5042">Reflita sobre seus valores</a></li>
<li><a href="#org3c13680">Examine suas respostas para temas e padrões</a></li>
<li><a href="#org9897188">Determine se sua vida se alinha com seus valores</a></li>
<li><a href="#org3789452">Considere os significados situacionais</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>󰎚</code></td>
</tr>
</tbody>
</table>

<p>
This content was transcribed from the images present on a 4Chan curated pack.
</p>

<p>
<b>Enjoy in being a better version of yourself!</b>
</p>
</blockquote>

<div id="outline-container-org65f3ed6" class="outline-2">
<h2 id="org65f3ed6">10 Personal Finances Tips</h2>
<div class="outline-text-2" id="text-org65f3ed6">
<ol class="org-ol">
<li>Spend less than you earn.</li>
<li>Build multiple streams of income.</li>
<li>Pay down the highest interest bearing debt first.</li>
<li>Income does not determine wealth.</li>
<li>Do everything in moderation.</li>
<li>Know the difference between good debt and bad debt.</li>
<li>Develop a Workable Household Budget.</li>
<li>Track your income and expenses.</li>
<li>Never assume past performance guarantees future results.</li>
<li>Pay the bills on time. By doing so you'll avoid spending money on needless late fees.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc947a17" class="outline-2">
<h2 id="orgc947a17">The 3 Types of People To Surround Yourself With</h2>
<div class="outline-text-2" id="text-orgc947a17">
<ul class="org-ul">
<li><b>The Dreamer:</b> It’s important to have someone who always thinks positive and keeps you believing!</li>
<li><b>The Hardworker:</b> You need someone who will keep pushing your work ethic to new heights into actions</li>
<li><b>The Realist:</b> This person will keep you level-headed and make sure your thinking deeper &#x2026;</li>
</ul>
</div>
</div>
<div id="outline-container-org558ea8d" class="outline-2">
<h2 id="org558ea8d">5 LEARNABLE MINDSETS OF SUCCESSFUL PEOPLE</h2>
<div class="outline-text-2" id="text-org558ea8d">
<ol class="org-ol">
<li>Successful people know and accept themselves.</li>
<li>Successful people set goals congruent with their personality, values, interests, strengths, skills, mission and purpose.</li>
<li>Successful people know they have much more control over the trajectory of their lives than others realize.</li>
<li>Successful people accept that they will repeatedly go through tough times.</li>
<li>Successful people know that once they get to their destination, they will find another.</li>
</ol>
</div>
</div>
<div id="outline-container-org969079d" class="outline-2">
<h2 id="org969079d">9 THINGS TO DO IN YOUR 20S TO BECOME A MILLIONAIRE BY 30</h2>
<div class="outline-text-2" id="text-org969079d">
<ol class="org-ol">
<li>Focus on earning.</li>
<li>Develop multiple streams of income</li>
<li>Save to invest, don't save to save.</li>
<li>Don't show off - show up.</li>
<li>Change your mindset about money.</li>
<li>Invest in yourself.</li>
<li>Set goals and visualize achieving them.</li>
<li>Start hanging out with people you admire.</li>
<li>Shoot for $10 million, not $1 million.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd47600c" class="outline-2">
<h2 id="orgd47600c">tips<sub>for</sub><sub>a</sub><sub>successful</sub><sub>life</sub></h2>
<div class="outline-text-2" id="text-orgd47600c">
<p>
<b>Millionaire's rules you will never learn in school</b>
</p>
<ul class="org-ul">
<li><b>You will not make six figure salary after school:</b> You will have to work hard for what you get</li>
<li><b>Your parents know something you don't:</b> Perhaps, before you were born, your parents weren't as boring as they are now</li>
<li><b>Life is not fair. Get used to It:</b> Stop expecting life to hand you the things you think you "deserve"</li>
<li><b>"Flipping Burgers" is not beneath your dignity:</b> Swallow your pride and take that job you think is beneath you as stepping stone</li>
<li><b>Your school may have done away with winners and losers but life has not:</b> The result of an exam does not justify the means. It doesn't bear the slightest resemblance to anything in real life</li>
<li><b>The world doesn't care about your self esteem</b></li>
<li><b>If you mess up, it's not your parents fault:</b> Stop spreading the blame around and take responsibility for your failures</li>
<li><b>Life is not divided into semesters:</b> Once life starts, it just goes on and on. So spend your time doing something worthwhile</li>
</ul>
</div>
</div>
<div id="outline-container-org08db871" class="outline-2">
<h2 id="org08db871">WHY BECOMING RICH QUICK IS DANGEROUS</h2>
<div class="outline-text-2" id="text-org08db871">
<p>
Did you know that many lottery winners go broke after a couple of years?
</p>
<ol class="org-ol">
<li>If you don’t work your ass off for your money you will not understand the real value of it</li>
<li>Money that comes fast gets spent fast</li>
<li>Many people who get rich quick or by luck stop spending it logically and start spending emotionally</li>
<li>You need a certain financial education in order to invest your money in a correct and clever way</li>
<li>Remember that you can always fall way faster than you climbed to the top</li>
</ol>

<p>
Being broke can teach you the most valuable lessons in life which spoiled rich kids will never understand.
That’s why I’m grateful for the fact that I failed so badly before I started making real money.
</p>
</div>
</div>
<div id="outline-container-org0f4aebb" class="outline-2">
<h2 id="org0f4aebb">great<sub>minds</sub><sub>discuss</sub><sub>ideas</sub></h2>
<div class="outline-text-2" id="text-org0f4aebb">
<ul class="org-ul">
<li><b>Great minds discuss ideas:</b> philosophy science happiness epistomology psychology art creativity knowledge self spirituality improvement solutions abstraction music relationships peace</li>
<li><b>Average minds discuss events:</b> news weather politics religion television sales sports work concerts activities plans</li>
<li><b>Small minds discuss people:</b> gossip drama politicians peers clergymen leaders neighbors friends family coworkers</li>
</ul>
</div>
</div>
