posts/copied/20250607-4chan_forMyAnons_pack.org
* LACK PEOPLE WITH DREAMS
#+begin_quote
The worst people to serve are the Poor people.

- Give them free, they think it's a trap.
- Tell them it's a small investment, they'll say can't earn much.
- Tell them to come in big, they'll say no money.
- Tell them try new things, they'll say no experience.
- Tell them it's traditional business, hard to do.
- Tell them it's a new business model, they'll say it's MLM.
- Tell them to run a shop, they'll say no freedom.
- Tell them run new business, They'll say no expertise.

They do have somethings in common: They love to ask google, listen to friends who are as hopeless as them, they think more than an university professor and do less than a blind man. Just ask them, what can they do.
They won't be able to answer you.

My conclusion:
- Instead of your heart beats faster, why not you just act faster a bit;
- Instead of just thinking about it, why not do something about it.
Poor people fail because on one common behavior: *Their Whole Life is About Waiting.*
#+end_quote
*WE ARE NEVER IN LACK OF MONEY.*\\
*WE LACK PEOPLE WITH DREAMS,*\\
*WHO CAN DIE FOR THOSE DREAMS.*
* RICH POOR VS POOR PEOPLE
- *Rich people*: Would rather be educated than entertained.
- *Poor people*: Would rather be entertained than educated.
* Right environment
*Your environment matters*

A TREE has to be planted in the right Environment in order to Grow or else it will DIE

A human being has the choice and power to move from.

From the Wrong Environment to the RIGHT one.

In order to grow...
* Spend your time wisely
*Everyday you get:* 24 hours 1,440 minutes 86,400 seconds

=Nonrefundable. Nonrenewable.=

*Be very selective of how you use your time.*
- Spending: Non-educational TV, Going out excessively, Too much social media, Gossiping about others
- Investing: Networking, Learn a new skill, Read a new book, Building a side hustle
* Successful vs Unsuccessful People
** SUCCESSFUL PEOPLE
1. Read every day
2. Compliment
3. Embrace Change
4. Forgive others
5. Talk about ideas
6. Continuously learn
7. Accept responsibility for their failures
** UNSUCCESSFUL PEOPLE
1. Watch TV every day
2. Criticize
3. Fear change
4. Hold a grudge
5. Talk about people
6. Think they know it all
7. Blame others for their failures
* Surround yourself with good people
Surround yourself with people that push you to do better.

No drama or negativity.

Just higher goals and higher motivation.

Good times and positive energy.

No jealousy or hate.

Simply bringing out the absolute best in each other.
* Successful vs Unsuccessful People
** SUCCESSFUL PEOPLE
1. Give other people credit for their victories
2. Exude joy
3. Share information and data
4. Continuously learn
5. Keep a journal
6. Keep a "TO-DO Project" list
7. Talk about ideas
8. Set goals and develop life plans
9. Want others to succeed
10. Operate from a transformational perspective
11. Accept responsibility
12. Read everyday
13. Keep a "TO-*BE*" list
14. Forgive others
15. Embrace change
16. Compliment
** UNSUCCESSFUL PEOPLE
1. Secretely hope others to fail
2. Don't know what they want to be
3. Blame others for their failures
4. Hold a grudge
5. Talk about people
6. Fly by their seats or their pants
7. Take all credits of their victories
8. Operate from a transactional perspective
9. Exude anger
10. Horde information and data
11. Say they keep a journal but they don't
12. Think they know it all
13. Fear change
14. Criticize
15. Have a sense of entitlement
16. Never set goals
* Little chickens
Most People are poor because, when it comes to investing, the world is filled with Chickens Littles running around yelling, "The sky is falling! The sky is falling!" And Chickens Littles are effective, because everyone of us is a little chicken.\\
It often takes great Courage to not let rumors and talk of doom and gloom affect your doubts and fears.\\
But a savvy investor knows that the seemingly worst of times is actually the best of times to make money.\\
When everyone else is too afraid to act, they pull the trigger and are rewarded.
* Make money: The startup way
1. *Find a product* (or a idea) that is popular but not perfect.
2. Buy one and *study* it in detail
3. Figure out how to *improve*
4. Make a *prototype*
5. *Show* the prototype o 100 people
6. *Remake it*, until people start ordering it (ex. Kickstarter)
7. Find a *co-founder* who can build it with you
8. *Split* with your co-founder 50% (use vesting)
9. Find a person with a lot of money, an *investor*
10. *Give* her 10% of your company
11. *Make* the product
12. *Sell your product* to 1 million people
13. Get *more money*
14. List your company on *stock exchange* like NASDAQ
15. Your investor, your co-founder and you all make money when you *sell shares* there
* You need 3 hobbies
# Sun Jan 21 05:58:38 2024
- One to keep you *creative*
- One to keep you *in shape*
- One to make you *money*
* 10 simple rules for self-improvement
- Find the right circle
- Educate yourself daily
- Get comfortable being uncomfortable
- Avoid negative people
- Take up a new life challenge
- Write down your goals
- Wake up early
- Improve upon your strengths
- Ask for feedback
- Acklowledge your flaws
* 10 things that require zero talent
- Being on time
- Work ethic
- Effort
- Body language
- Energy
- Attitude
- Passion
- Being coachable
- Doing extra
- Being prepared
* 19 Habits to live by
- Network.
- Dream big.
- Plan ahead.
- Get up early.
- Stay focused.
- Watch less TV.
- Read more books.
- Invest in yourself.
- Avoid time wasters.
- Take calculated risks.
- Write down your goals.
- Live on less than you make.
- Make your health a priority.
- Do work that matters to you.
- Learn from people you admire.
- Foster meaningful relationships.
- Take action, even when it's scary.
- Cultivate an attitude of gratitude.
- Have a powerful and inspiring "why".
