copied/20250607-4chan_forMyAnons_pack.html
<div id="outline-container-orgb815694" class="outline-2">
<h2 id="orgb815694">Invest in yourself</h2>
<div class="outline-text-2" id="text-orgb815694">
<ul class="org-ul">
<li>Quit a habit</li>
<li>Work out</li>
<li>Meditate</li>
<li>Self-reflect</li>
<li>Learn a new skill</li>
<li>Read</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd184ce" class="outline-2">
<h2 id="orgcd184ce">LACK PEOPLE WITH DREAMS</h2>
<div class="outline-text-2" id="text-orgcd184ce">
<blockquote>
<p>
The worst people to serve are the Poor people.
</p>

<ul class="org-ul">
<li>Give them free, they think it's a trap.</li>
<li>Tell them it's a small investment, they'll say can't earn much.</li>
<li>Tell them to come in big, they'll say no money.</li>
<li>Tell them try new things, they'll say no experience.</li>
<li>Tell them it's traditional business, hard to do.</li>
<li>Tell them it's a new business model, they'll say it's MLM.</li>
<li>Tell them to run a shop, they'll say no freedom.</li>
<li>Tell them run new business, They'll say no expertise.</li>
</ul>

<p>
They do have somethings in common: They love to ask google, listen to friends who are as hopeless as them, they think more than an university professor and do less than a blind man. Just ask them, what can they do.
They won't be able to answer you.
</p>

<p>
My conclusion:
</p>
<ul class="org-ul">
<li>Instead of your heart beats faster, why not you just act faster a bit;</li>
<li>Instead of just thinking about it, why not do something about it.</li>
</ul>
<p>
Poor people fail because on one common behavior: <b>Their Whole Life is About Waiting.</b>
</p>
</blockquote>
<p>
<b>WE ARE NEVER IN LACK OF MONEY.</b><br>
<b>WE LACK PEOPLE WITH DREAMS,</b><br>
<b>WHO CAN DIE FOR THOSE DREAMS.</b>
</p>
</div>
</div>
<div id="outline-container-org9a719ae" class="outline-2">
<h2 id="org9a719ae">RICH POOR VS POOR PEOPLE</h2>
<div class="outline-text-2" id="text-org9a719ae">
<ul class="org-ul">
<li><b>Rich people</b>: Would rather be educated than entertained.</li>
<li><b>Poor people</b>: Would rather be entertained than educated.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcef08f" class="outline-2">
<h2 id="orgfcef08f">Right environment</h2>
<div class="outline-text-2" id="text-orgfcef08f">
<p>
<b>Your environment matters</b>
</p>

<p>
A TREE has to be planted in the right Environment in order to Grow or else it will DIE
</p>

<p>
A human being has the choice and power to move from.
</p>

<p>
From the Wrong Environment to the RIGHT one.
</p>

<p>
In order to grow&#x2026;
</p>
</div>
</div>
<div id="outline-container-orga98ac62" class="outline-2">
<h2 id="orga98ac62">Spend your time wisely</h2>
<div class="outline-text-2" id="text-orga98ac62">
<p>
<b>Everyday you get:</b> 24 hours 1,440 minutes 86,400 seconds
</p>

<p>
<code>Nonrefundable. Nonrenewable.</code>
</p>

<p>
<b>Be very selective of how you use your time.</b>
</p>
<ul class="org-ul">
<li>Spending: Non-educational TV, Going out excessively, Too much social media, Gossiping about others</li>
<li>Investing: Networking, Learn a new skill, Read a new book, Building a side hustle</li>
</ul>
</div>
</div>
<div id="outline-container-orgf8a67fd" class="outline-2">
<h2 id="orgf8a67fd">Successful vs Unsuccessful People</h2>
<div class="outline-text-2" id="text-orgf8a67fd">
</div>
<div id="outline-container-org3c5589d" class="outline-3">
<h3 id="org3c5589d">SUCCESSFUL PEOPLE</h3>
<div class="outline-text-3" id="text-org3c5589d">
<ol class="org-ol">
<li>Read every day</li>
<li>Compliment</li>
<li>Embrace Change</li>
<li>Forgive others</li>
<li>Talk about ideas</li>
<li>Continuously learn</li>
<li>Accept responsibility for their failures</li>
</ol>
</div>
</div>
<div id="outline-container-org48f18b4" class="outline-3">
<h3 id="org48f18b4">UNSUCCESSFUL PEOPLE</h3>
<div class="outline-text-3" id="text-org48f18b4">
<ol class="org-ol">
<li>Watch TV every day</li>
<li>Criticize</li>
<li>Fear change</li>
<li>Hold a grudge</li>
<li>Talk about people</li>
<li>Think they know it all</li>
<li>Blame others for their failures</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9355482" class="outline-2">
<h2 id="org9355482">Surround yourself with good people</h2>
<div class="outline-text-2" id="text-org9355482">
<p>
Surround yourself with people that push you to do better.
</p>

<p>
No drama or negativity.
</p>

<p>
Just higher goals and higher motivation.
</p>

<p>
Good times and positive energy.
</p>

<p>
No jealousy or hate.
</p>

<p>
Simply bringing out the absolute best in each other.
</p>
</div>
</div>
<div id="outline-container-org495f649" class="outline-2">
<h2 id="org495f649">Successful vs Unsuccessful People</h2>
<div class="outline-text-2" id="text-org495f649">
</div>
<div id="outline-container-org673732b" class="outline-3">
<h3 id="org673732b">SUCCESSFUL PEOPLE</h3>
<div class="outline-text-3" id="text-org673732b">
<ol class="org-ol">
<li>Give other people credit for their victories</li>
<li>Exude joy</li>
<li>Share information and data</li>
<li>Continuously learn</li>
<li>Keep a journal</li>
<li>Keep a "TO-DO Project" list</li>
<li>Talk about ideas</li>
<li>Set goals and develop life plans</li>
<li>Want others to succeed</li>
<li>Operate from a transformational perspective</li>
<li>Accept responsibility</li>
<li>Read everyday</li>
<li>Keep a "TO-<b>BE</b>" list</li>
<li>Forgive others</li>
<li>Embrace change</li>
<li>Compliment</li>
</ol>
</div>
</div>
<div id="outline-container-org2499a26" class="outline-3">
<h3 id="org2499a26">UNSUCCESSFUL PEOPLE</h3>
<div class="outline-text-3" id="text-org2499a26">
<ol class="org-ol">
<li>Secretely hope others to fail</li>
<li>Don't know what they want to be</li>
<li>Blame others for their failures</li>
<li>Hold a grudge</li>
<li>Talk about people</li>
<li>Fly by their seats or their pants</li>
<li>Take all credits of their victories</li>
<li>Operate from a transactional perspective</li>
<li>Exude anger</li>
<li>Horde information and data</li>
<li>Say they keep a journal but they don't</li>
<li>Think they know it all</li>
<li>Fear change</li>
<li>Criticize</li>
<li>Have a sense of entitlement</li>
<li>Never set goals</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7e2c203" class="outline-2">
<h2 id="org7e2c203">Little chickens</h2>
<div class="outline-text-2" id="text-org7e2c203">
<p>
Most People are poor because, when it comes to investing, the world is filled with Chickens Littles running around yelling, "The sky is falling! The sky is falling!" And Chickens Littles are effective, because everyone of us is a little chicken.<br>
It often takes great Courage to not let rumors and talk of doom and gloom affect your doubts and fears.<br>
But a savvy investor knows that the seemingly worst of times is actually the best of times to make money.<br>
When everyone else is too afraid to act, they pull the trigger and are rewarded.
</p>
</div>
</div>
<div id="outline-container-org53356f2" class="outline-2">
<h2 id="org53356f2">Make money: The startup way</h2>
<div class="outline-text-2" id="text-org53356f2">
<ol class="org-ol">
<li><b>Find a product</b> (or a idea) that is popular but not perfect.</li>
<li>Buy one and <b>study</b> it in detail</li>
<li>Figure out how to <b>improve</b></li>
<li>Make a <b>prototype</b></li>
<li><b>Show</b> the prototype o 100 people</li>
<li><b>Remake it</b>, until people start ordering it (ex. Kickstarter)</li>
<li>Find a <b>co-founder</b> who can build it with you</li>
<li><b>Split</b> with your co-founder 50% (use vesting)</li>
<li>Find a person with a lot of money, an <b>investor</b></li>
<li><b>Give</b> her 10% of your company</li>
<li><b>Make</b> the product</li>
<li><b>Sell your product</b> to 1 million people</li>
<li>Get <b>more money</b></li>
<li>List your company on <b>stock exchange</b> like NASDAQ</li>
<li>Your investor, your co-founder and you all make money when you <b>sell shares</b> there</li>
</ol>
</div>
</div>
<div id="outline-container-org729b2d2" class="outline-2">
<h2 id="org729b2d2">You need 3 hobbies</h2>
<div class="outline-text-2" id="text-org729b2d2">
<ul class="org-ul">
<li>One to keep you <b>creative</b></li>
<li>One to keep you <b>in shape</b></li>
<li>One to make you <b>money</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf68231" class="outline-2">
<h2 id="orgbf68231">10 simple rules for self-improvement</h2>
<div class="outline-text-2" id="text-orgbf68231">
<ul class="org-ul">
<li>Find the right circle</li>
<li>Educate yourself daily</li>
<li>Get comfortable being uncomfortable</li>
<li>Avoid negative people</li>
<li>Take up a new life challenge</li>
<li>Write down your goals</li>
<li>Wake up early</li>
<li>Improve upon your strengths</li>
<li>Ask for feedback</li>
<li>Acklowledge your flaws</li>
</ul>
</div>
</div>
<div id="outline-container-org2ca8620" class="outline-2">
<h2 id="org2ca8620">10 things that require zero talent</h2>
<div class="outline-text-2" id="text-org2ca8620">
<ul class="org-ul">
<li>Being on time</li>
<li>Work ethic</li>
<li>Effort</li>
<li>Body language</li>
<li>Energy</li>
<li>Attitude</li>
<li>Passion</li>
<li>Being coachable</li>
<li>Doing extra</li>
<li>Being prepared</li>
</ul>
</div>
</div>
<div id="outline-container-org1358118" class="outline-2">
<h2 id="org1358118">19 Habits to live by</h2>
<div class="outline-text-2" id="text-org1358118">
<ul class="org-ul">
<li>Network.</li>
<li>Dream big.</li>
<li>Plan ahead.</li>
<li>Get up early.</li>
<li>Stay focused.</li>
<li>Watch less TV.</li>
<li>Read more books.</li>
<li>Invest in yourself.</li>
<li>Avoid time wasters.</li>
<li>Take calculated risks.</li>
<li>Write down your goals.</li>
<li>Live on less than you make.</li>
<li>Make your health a priority.</li>
<li>Do work that matters to you.</li>
<li>Learn from people you admire.</li>
<li>Foster meaningful relationships.</li>
<li>Take action, even when it's scary.</li>
<li>Cultivate an attitude of gratitude.</li>
<li>Have a powerful and inspiring "why".</li>
</ul>
</div>
</div>
