posts/copied/20250607-4chan_forMyAnons_pack.org
* Three simple rules in life
1. If you do not *go* after what you want, you'll never have it.
2. If you do not *ask* the answer will always be *no*.
3. If you do not step *forward*, you *always* be in the same place
* 4 Ways to invest your time wisely
1. Turn off television.
  - Try educational YouTube videos instead.
2. Read more books
  - Aim for 30 minutes per day of uninterrupted reading.
3. Listen to podcasts.
  - Try replacing music with a podcast during your commute.
4. Plan your day the night before.
  - Use a journal to structure your goals throughout the day
* Adopt the mindset
You choose how you experience life. You can't choose the cards you were dealt but you choose what to do with them.

STOP VIEWING YOURSELF AS A VICTIM\\
"Avenger" and "Survivor" self-images presuppose victimhood.

BE TRULY INDEPENDENT

** Practice Mindfulness Meditation
You can't just resolve to think in a new way.\\
You have a million more or less conscious narratives in your head that influence everything. Work to get rid of them. Learn to be objective and control your emotions.

Being more mindful is also the pre-requisite for any following advice.

RESEARCH THE PRATICE, put the work in, don't expect an instasnt fix.
** Stay In The Present Moment
Stop fantasizing about the future. Stop dreading it.\\
Stop wallowing in the past mistakes. Stop thinking how much better things used to be.

Think objectively what you want from the future, and non-judgmentally learn from past.
** Set Goals
Look at yourself and objectively decite what you CAN improve upon first.

DO NOT think about what you "should" improve upon first. If you're spending months or years thinking "I need to do X" while not actually not making any progress, it's clearly not the thing you need to be focusing on.

Hold yourself accountable but realize that fuck ups are just there to help you re-calibrate your compass.
*** Improve Your "Stuff"
Keep your surroundings clean to a level you are truly satisfied with.

Temperately acquire things that you like, that inspire you and that make you comfortable but realize that barely anything you can buy is truly necessary.\\
Get rid of things that do nothing for you.

Recycle. Invest in Quality and Sustainability

Save money. Even if it's just a fraction of what you make. do it.
**** Have Beneficial Hobbies
Acquire hobbies that rejuvenate you. Doesn't matter what it is, if it replenishes your energy, good. If starts to drain, it's not a hobby, it's an addiction.

Also acquire hobbies that improve your skills. Learn a second language. Create. Read
*** Improve Your Fitness Level
Figure out what your specific goal is. Aesthetics? Functional Strength? Good Cardio? Raw Power? Mix of all?

Seek help in building a workout regime that lines up with what you want and what you actually do.

START SMALL, learn correct techniques.

Sore muscles are fine. Aching joints, stinging bones are not.
**** Lose/Gain Weight
LEARN TO COUNT CALORIES

Adopt eating habits that advance your goal, that you actually stick to. There could be the greatest, scientifically proven diet out there and it will do absolutely nothing for you if you aren't sticking to it.
**** Groom Yourself
Brush your teeth twice a day. Floss. Have regular dental exams.

Get a hairstyle that suits you and that you will actually maintain. Ask your barber.

Use deodorant but be careful about using too much scented products.

Find a skincare regime that works for you. If it ain't broke, don't fix it.
*** Improve Mental Health
**** Improve Social Skills
Stop thinking you NEED other people. This is not some edgy nihilism, just a way to healthy social interactions.

Welcome everyone without judgment

But stop desperate grasping for people because you think you "should" have friends or you "should" be in a relationship.

YOU HAVE ALL THE VALIDATION AND LOVE YOU NEED INSIDE YOURSELF

And truly realizing this will make you far more attractive than anything else

See yourself in everyone

Spend at least 5 minutes thinking about that sentence. Write it on paper and wrestle with it.
**** Improve Work
DON'T BE A WHINER. This doesn't mean never give constructive critique when given an opportunity, just don't be the guy always moaning about how hard something is. Nothing wrong with being dissatisfied either, just keep complaints out of the day-to-day professional setting.

Be dependable, not charitable. If something extra is within the scope of your duties, do it. Stay that much ahead of your work. If it's clearly you taking someone else's work, kindly refuse.\\
This can be very hard.

AVOID DRAMA. Don't gossip, don't talk shit about people.
# this part is relevant

Avoid bringing work home (bar homework).
* Allow things to pass
You will continue to suffer if you have an emotional reaction to everything is said to you.

True power is sitting back and observing things with logic. True power is restraint. If words control you that means everyone else can control you.

Breathe and allow things to pass.
* Confort is a drug
Once you get used to it, it becomes addicting.

Give a weak mean consistent sex, good food, cheap entertainment and he'll throw his ambitions right out the window.

*The comfort zone is where dreams go die*
# awesome phrase. i love it
* Do not try to change the world
#+begin_quote
Everyone things of changing the world, but no one things of changing himself.

-- Leo Tolstoy
#+end_quote
* Five Things Mentally Strong People Do
- They enjoy their time alone.
  They hold themselves accountable for their actions.
- They celebrate the success of others.
  They surround themselves with greatness.
- They have great health habits. From sleep to hot they eat, they own mind, body and spirit.
- They embrace and celebrate change.
  They know that change is constant with life.
- They invest time and energy into the present.
  They're able to focus on the tasks at hand.
* Great minds
*GREAT* people talk about *IDEAS*

*AVERAGE* people talk about *THINGS*

*SMALL* people talk about *OTHER PEOPLE*
* Growth and Fixed Mindset
