copied/20250607-4chan_forMyAnons_pack.html
<div id="outline-container-org372053b" class="outline-2">
<h2 id="org372053b">Three simple rules in life</h2>
<div class="outline-text-2" id="text-org372053b">
<ol class="org-ol">
<li>If you do not <b>go</b> after what you want, you'll never have it.</li>
<li>If you do not <b>ask</b> the answer will always be <b>no</b>.</li>
<li>If you do not step <b>forward</b>, you <b>always</b> be in the same place</li>
</ol>
</div>
</div>
<div id="outline-container-org1b8a482" class="outline-2">
<h2 id="org1b8a482">4 Ways to invest your time wisely</h2>
<div class="outline-text-2" id="text-org1b8a482">
<ol class="org-ol">
<li>Turn off television.
<ul class="org-ul">
<li>Try educational YouTube videos instead.</li>
</ul></li>
<li>Read more books
<ul class="org-ul">
<li>Aim for 30 minutes per day of uninterrupted reading.</li>
</ul></li>
<li>Listen to podcasts.
<ul class="org-ul">
<li>Try replacing music with a podcast during your commute.</li>
</ul></li>
<li>Plan your day the night before.
<ul class="org-ul">
<li>Use a journal to structure your goals throughout the day</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgf4e36ba" class="outline-2">
<h2 id="orgf4e36ba">Adopt the mindset</h2>
<div class="outline-text-2" id="text-orgf4e36ba">
<p>
You choose how you experience life. You can't choose the cards you were dealt but you choose what to do with them.
</p>

<p>
STOP VIEWING YOURSELF AS A VICTIM<br>
"Avenger" and "Survivor" self-images presuppose victimhood.
</p>

<p>
BE TRULY INDEPENDENT
</p>
</div>

<div id="outline-container-org4bebfbe" class="outline-3">
<h3 id="org4bebfbe">Practice Mindfulness Meditation</h3>
<div class="outline-text-3" id="text-org4bebfbe">
<p>
You can't just resolve to think in a new way.<br>
You have a million more or less conscious narratives in your head that influence everything. Work to get rid of them. Learn to be objective and control your emotions.
</p>

<p>
Being more mindful is also the pre-requisite for any following advice.
</p>

<p>
RESEARCH THE PRATICE, put the work in, don't expect an instasnt fix.
</p>
</div>
</div>
<div id="outline-container-org6e7416e" class="outline-3">
<h3 id="org6e7416e">Stay In The Present Moment</h3>
<div class="outline-text-3" id="text-org6e7416e">
<p>
Stop fantasizing about the future. Stop dreading it.<br>
Stop wallowing in the past mistakes. Stop thinking how much better things used to be.
</p>

<p>
Think objectively what you want from the future, and non-judgmentally learn from past.
</p>
</div>
</div>
<div id="outline-container-orgbe7117d" class="outline-3">
<h3 id="orgbe7117d">Set Goals</h3>
<div class="outline-text-3" id="text-orgbe7117d">
<p>
Look at yourself and objectively decite what you CAN improve upon first.
</p>

<p>
DO NOT think about what you "should" improve upon first. If you're spending months or years thinking "I need to do X" while not actually not making any progress, it's clearly not the thing you need to be focusing on.
</p>

<p>
Hold yourself accountable but realize that fuck ups are just there to help you re-calibrate your compass.
</p>
</div>
<div id="outline-container-org12c8ede" class="outline-4">
<h4 id="org12c8ede">Improve Your "Stuff"</h4>
<div class="outline-text-4" id="text-org12c8ede">
<p>
Keep your surroundings clean to a level you are truly satisfied with.
</p>

<p>
Temperately acquire things that you like, that inspire you and that make you comfortable but realize that barely anything you can buy is truly necessary.<br>
Get rid of things that do nothing for you.
</p>

<p>
Recycle. Invest in Quality and Sustainability
</p>

<p>
Save money. Even if it's just a fraction of what you make. do it.
</p>
</div>
<ul class="org-ul">
<li><a id="org141f210"></a>Have Beneficial Hobbies<br>
<div class="outline-text-5" id="text-org141f210">
<p>
Acquire hobbies that rejuvenate you. Doesn't matter what it is, if it replenishes your energy, good. If starts to drain, it's not a hobby, it's an addiction.
</p>

<p>
Also acquire hobbies that improve your skills. Learn a second language. Create. Read
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org374904a" class="outline-4">
<h4 id="org374904a">Improve Your Fitness Level</h4>
<div class="outline-text-4" id="text-org374904a">
<p>
Figure out what your specific goal is. Aesthetics? Functional Strength? Good Cardio? Raw Power? Mix of all?
</p>

<p>
Seek help in building a workout regime that lines up with what you want and what you actually do.
</p>

<p>
START SMALL, learn correct techniques.
</p>

<p>
Sore muscles are fine. Aching joints, stinging bones are not.
</p>
</div>
<ul class="org-ul">
<li><a id="org6d7fd02"></a>Lose/Gain Weight<br>
<div class="outline-text-5" id="text-org6d7fd02">
<p>
LEARN TO COUNT CALORIES
</p>

<p>
Adopt eating habits that advance your goal, that you actually stick to. There could be the greatest, scientifically proven diet out there and it will do absolutely nothing for you if you aren't sticking to it.
</p>
</div>
</li>
<li><a id="org5a45bdf"></a>Groom Yourself<br>
<div class="outline-text-5" id="text-org5a45bdf">
<p>
Brush your teeth twice a day. Floss. Have regular dental exams.
</p>

<p>
Get a hairstyle that suits you and that you will actually maintain. Ask your barber.
</p>

<p>
Use deodorant but be careful about using too much scented products.
</p>

<p>
Find a skincare regime that works for you. If it ain't broke, don't fix it.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgad200ec" class="outline-4">
<h4 id="orgad200ec">Improve Mental Health</h4>
<div class="outline-text-4" id="text-orgad200ec">
</div>
<ul class="org-ul">
<li><a id="org7dfc4d1"></a>Improve Social Skills<br>
<div class="outline-text-5" id="text-org7dfc4d1">
<p>
Stop thinking you NEED other people. This is not some edgy nihilism, just a way to healthy social interactions.
</p>

<p>
Welcome everyone without judgment
</p>

<p>
But stop desperate grasping for people because you think you "should" have friends or you "should" be in a relationship.
</p>

<p>
YOU HAVE ALL THE VALIDATION AND LOVE YOU NEED INSIDE YOURSELF
</p>

<p>
And truly realizing this will make you far more attractive than anything else
</p>

<p>
See yourself in everyone
</p>

<p>
Spend at least 5 minutes thinking about that sentence. Write it on paper and wrestle with it.
</p>
</div>
</li>
<li><a id="orgba5ff13"></a>Improve Work<br>
<div class="outline-text-5" id="text-orgba5ff13">
<p>
DON'T BE A WHINER. This doesn't mean never give constructive critique when given an opportunity, just don't be the guy always moaning about how hard something is. Nothing wrong with being dissatisfied either, just keep complaints out of the day-to-day professional setting.
</p>

<p>
Be dependable, not charitable. If something extra is within the scope of your duties, do it. Stay that much ahead of your work. If it's clearly you taking someone else's work, kindly refuse.<br>
This can be very hard.
</p>

<p>
AVOID DRAMA. Don't gossip, don't talk shit about people.
</p>

<p>
Avoid bringing work home (bar homework).
</p>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8cb444b" class="outline-2">
<h2 id="org8cb444b">Allow things to pass</h2>
<div class="outline-text-2" id="text-org8cb444b">
<p>
You will continue to suffer if you have an emotional reaction to everything is said to you.
</p>

<p>
True power is sitting back and observing things with logic. True power is restraint. If words control you that means everyone else can control you.
</p>

<p>
Breathe and allow things to pass.
</p>
</div>
</div>
<div id="outline-container-org3d1b9d4" class="outline-2">
<h2 id="org3d1b9d4">Confort is a drug</h2>
<div class="outline-text-2" id="text-org3d1b9d4">
<p>
Once you get used to it, it becomes addicting.
</p>

<p>
Give a weak mean consistent sex, good food, cheap entertainment and he'll throw his ambitions right out the window.
</p>

<p>
<b>The comfort zone is where dreams go die</b>
</p>
</div>
</div>
<div id="outline-container-orgd78b68a" class="outline-2">
<h2 id="orgd78b68a">Do not try to change the world</h2>
<div class="outline-text-2" id="text-orgd78b68a">
<blockquote>
<p>
Everyone things of changing the world, but no one things of changing himself.
</p>

<p>
&#x2013; Leo Tolstoy
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgceffe85" class="outline-2">
<h2 id="orgceffe85">Five Things Mentally Strong People Do</h2>
<div class="outline-text-2" id="text-orgceffe85">
<ul class="org-ul">
<li>They enjoy their time alone.
They hold themselves accountable for their actions.</li>
<li>They celebrate the success of others.
They surround themselves with greatness.</li>
<li>They have great health habits. From sleep to hot they eat, they own mind, body and spirit.</li>
<li>They embrace and celebrate change.
They know that change is constant with life.</li>
<li>They invest time and energy into the present.
They're able to focus on the tasks at hand.</li>
</ul>
</div>
</div>
<div id="outline-container-org0a5095d" class="outline-2">
<h2 id="org0a5095d">Great minds</h2>
<div class="outline-text-2" id="text-org0a5095d">
<p>
<b>GREAT</b> people talk about <b>IDEAS</b>
</p>

<p>
<b>AVERAGE</b> people talk about <b>THINGS</b>
</p>

<p>
<b>SMALL</b> people talk about <b>OTHER PEOPLE</b>
</p>
</div>
</div>
<div id="outline-container-org540ddfb" class="outline-2">
<h2 id="org540ddfb">Growth and Fixed Mindset</h2>
<div class="outline-text-2" id="text-org540ddfb">
</div>
