posts/copied/20250607-4chan_forMyAnons_pack.org
** Growth Mindset
1. Embraces challenges
2. Persists in the face of setbacks
3. Sees effort as the path to mastery
4. Learns from criticism
5. Find lessons and inspiration in the success of others
** Fixed Mindset
1. Avoid challenges
2. Gets frustrated or gives up easily
3. Thinks potential is predetermined
4. Take criticism personally
5. Feels threatened by the success of others
* Inferior and Superior Man
#+begin_quote
The inferior man argues about his rights, while the superior man imposes duties on himself

Wagner Clemente Soto
#+end_quote
* Learn How To...
- Have fun without drinking
- Talk without mobile
- Dream without drugs
- Smile without selfies
- Love without conditions
* Lions don't roar
Lions don't have to roar. There is power in silence, confidence, and persistence.\\
Those who work don't talk, and those who talk don't work. Handle your business. Measure your efforts by results. Focus your time, energy, and activity on mastering and executing a plan.

*Avoid the energy draining practice of telling people what you're going to do.*
# crucial thing

Instead, spend your time and effort in doing the things that are necessary to accomplish your goals. Keep your focus. and stay determined in order to pursue your dream.

*Let your work, not your words, speak for itself.*

You deserve!
* Do Not associate With The Ignorant
#+begin_quote
If a wayfarer fails to find\\
one better or equal,\\
steadfast he should fare alone\\
for a fools no fellowship.
#+end_quote

Explanation: People need companions. But if one does not find a person who is better than, or at least equal to oneself, it is better to be alone rather than keep company with foolish people. There is no profitable companionship with fools.
* FAILURE
HOW TO OVERCOME THE FEAR OF IT.
1. Use it an opportunity to grow.
   "If you learn from defeat, you haven't really lost."
2. Figure out why you failed.
   "If you're not failing every now and again, it’s a sign you're not doing anything very innovative."
3. Failure is NOT FINAL.
   "Our greatest glory is not in never failing, but in rising every time we fail."
4. Stay Positive, It's all perspective.
   "I have not failed, I just found 10,000 ways that won't work."
* Spend on interior
#+begin_quote
Most people spend more on the exterior of their head than the interior.
#+end_quote
* Be consistent
SUCCESS DOESN'T COME FROM WHAT YOU DO OCCASIONALLY, BUT WHAT YOU CONSISTENTLY.
* You in 5 Years
#+begin_quote
The person you will be in five years depends largely on the books you read, the people you spend time with, the food you eat, the habits you adopt, and the conversations you engage in today.

Ruben Chavez
#+end_quote
* THE TWO SPIRITUAL CURRENCIES
There are two "Spiritual Currencies": *Time* and *Attention*.

This analogy can be seen very readily in the sayings "Spending Time" and "Paying Attention".

Whatever information or endeavors we put our time and attention toward, we end up getting something in return for that investment.

This return could come in the form of knowledge, understanding, skills, expertise, and empowerment, if we invest our Spiritual Currencies wisely.
* 29 ways to stay creative
1. Make lists
2. Carry a *notebook* everywhere
3. *Try free writing*
4. *Get away* from the computer
5. Quit beating *yourself* up
6. Take *breaks*
7. *Sing* in the shower
8. Drink *coffee*
9. *Listen* to new music
10. *Be open*
11. Surround yourself with *creative people*
12. Get *feedback*
13. *Collaborate*
14. *Don't give up*
15. Practice, *practice* and practice
16. Allow yourself to make *mistakes*
17. Go somewhere *new*
18. Count your *blessings*
19. Get lots of *rest*
20. Take *risks*
21. *BREAK THE RULES*
22. *Don't force it*
23. Read a page of *the dictionary*
24. Create a *framework*
25. Stop trying to be someone else's *perfect*
26. Got an *idea*? Write it down!
27. *Clean* your work place
28. *HAVE FUN*
29. *FINISH* something
* FRIENDS
#+begin_quote
You are the average of the *five people* you associate with most, so do not *underestimate* the effects of your pessimistic, unambitious, or disorganized friends. If someone isn't *making you stronger*, they're making you weaker.

-- Tim Ferriss
#+end_quote
* TO DO
- THINK POSITIVELY
- NETWORK WELL
- EXERCISE DAILY
- EAT HEALTHLY
- WORK HARD
- STAY STRONG
- BUILD FAITH
- WORRY LESS
- READ MORE
- BE HAPPY
- VOLUNTEER FREELY
- RELAX OFTEN
- LOVE ALWAYS
- LIVE FOREVER
* Educate yourself
When a question about a certain topic pops up, google it. Watch movies and documentaries. When something sparks your interest, read about it. Read read read. Study, learn stimulate your brain. Don't just rely on the school system, educate that beautiful mind of yours..
* Unhelpful thinking styles
** All or nothing thinking
Sometimes called "black and white thinking"

If I'm not perfect I have failed.

Either I do it right or not at all
** Mental filter
Only paying attention to certain types of evidence.

Noticing our failures but not seeking successes
** Jumping to conclusions
There's two key types of jumping to conclusions
- *Mind reading:* Imagining we know what others are thinking
- *Fortune telling:* Predicting the future
** Emotional reasoning
Assuming that because you feel a certain way what we think myst be true
#+begin_quote
I feel embarrassed so I must be an idiot
#+end_quote
** Labeling
Assigning labels to ourselves or other people
** Over-generalizing
Seeing a pater based upon a single event, or being overly broad in the conclusions we draw.
** Disqualifying the positive
Discounting the good things that happened or that you have done for some reason or another
#+begin_quote
That doesn't matter
#+end_quote
