copied/20250607-4chan_forMyAnons_pack.html
<div id="outline-container-orgb749da3" class="outline-3">
<h3 id="orgb749da3">Growth Mindset</h3>
<div class="outline-text-3" id="text-orgb749da3">
<ol class="org-ol">
<li>Embraces challenges</li>
<li>Persists in the face of setbacks</li>
<li>Sees effort as the path to mastery</li>
<li>Learns from criticism</li>
<li>Find lessons and inspiration in the success of others</li>
</ol>
</div>
</div>
<div id="outline-container-org007c5ff" class="outline-3">
<h3 id="org007c5ff">Fixed Mindset</h3>
<div class="outline-text-3" id="text-org007c5ff">
<ol class="org-ol">
<li>Avoid challenges</li>
<li>Gets frustrated or gives up easily</li>
<li>Thinks potential is predetermined</li>
<li>Take criticism personally</li>
<li>Feels threatened by the success of others</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4c6b17e" class="outline-2">
<h2 id="org4c6b17e">Inferior and Superior Man</h2>
<div class="outline-text-2" id="text-org4c6b17e">
<blockquote>
<p>
The inferior man argues about his rights, while the superior man imposes duties on himself
</p>

<p>
Wagner Clemente Soto
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org00e5e0a" class="outline-2">
<h2 id="org00e5e0a">Learn How To&#x2026;</h2>
<div class="outline-text-2" id="text-org00e5e0a">
<ul class="org-ul">
<li>Have fun without drinking</li>
<li>Talk without mobile</li>
<li>Dream without drugs</li>
<li>Smile without selfies</li>
<li>Love without conditions</li>
</ul>
</div>
</div>
<div id="outline-container-org07ee281" class="outline-2">
<h2 id="org07ee281">Lions don't roar</h2>
<div class="outline-text-2" id="text-org07ee281">
<p>
Lions don't have to roar. There is power in silence, confidence, and persistence.<br>
Those who work don't talk, and those who talk don't work. Handle your business. Measure your efforts by results. Focus your time, energy, and activity on mastering and executing a plan.
</p>

<p>
<b>Avoid the energy draining practice of telling people what you're going to do.</b>
</p>

<p>
Instead, spend your time and effort in doing the things that are necessary to accomplish your goals. Keep your focus. and stay determined in order to pursue your dream.
</p>

<p>
<b>Let your work, not your words, speak for itself.</b>
</p>

<p>
You deserve!
</p>
</div>
</div>
<div id="outline-container-org44296cf" class="outline-2">
<h2 id="org44296cf">Do Not associate With The Ignorant</h2>
<div class="outline-text-2" id="text-org44296cf">
<blockquote>
<p>
If a wayfarer fails to find<br>
one better or equal,<br>
steadfast he should fare alone<br>
for a fools no fellowship.
</p>
</blockquote>

<p>
Explanation: People need companions. But if one does not find a person who is better than, or at least equal to oneself, it is better to be alone rather than keep company with foolish people. There is no profitable companionship with fools.
</p>
</div>
</div>
<div id="outline-container-org39c3633" class="outline-2">
<h2 id="org39c3633">FAILURE</h2>
<div class="outline-text-2" id="text-org39c3633">
<p>
HOW TO OVERCOME THE FEAR OF IT.
</p>
<ol class="org-ol">
<li>Use it an opportunity to grow.
"If you learn from defeat, you haven't really lost."</li>
<li>Figure out why you failed.
"If you're not failing every now and again, it’s a sign you're not doing anything very innovative."</li>
<li>Failure is NOT FINAL.
"Our greatest glory is not in never failing, but in rising every time we fail."</li>
<li>Stay Positive, It's all perspective.
"I have not failed, I just found 10,000 ways that won't work."</li>
</ol>
</div>
</div>
<div id="outline-container-orgba11d6a" class="outline-2">
<h2 id="orgba11d6a">Spend on interior</h2>
<div class="outline-text-2" id="text-orgba11d6a">
<blockquote>
<p>
Most people spend more on the exterior of their head than the interior.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5639d91" class="outline-2">
<h2 id="org5639d91">Be consistent</h2>
<div class="outline-text-2" id="text-org5639d91">
<p>
SUCCESS DOESN'T COME FROM WHAT YOU DO OCCASIONALLY, BUT WHAT YOU CONSISTENTLY.
</p>
</div>
</div>
<div id="outline-container-org11a8e1d" class="outline-2">
<h2 id="org11a8e1d">You in 5 Years</h2>
<div class="outline-text-2" id="text-org11a8e1d">
<blockquote>
<p>
The person you will be in five years depends largely on the books you read, the people you spend time with, the food you eat, the habits you adopt, and the conversations you engage in today.
</p>

<p>
Ruben Chavez
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8118a2b" class="outline-2">
<h2 id="org8118a2b">THE TWO SPIRITUAL CURRENCIES</h2>
<div class="outline-text-2" id="text-org8118a2b">
<p>
There are two "Spiritual Currencies": <b>Time</b> and <b>Attention</b>.
</p>

<p>
This analogy can be seen very readily in the sayings "Spending Time" and "Paying Attention".
</p>

<p>
Whatever information or endeavors we put our time and attention toward, we end up getting something in return for that investment.
</p>

<p>
This return could come in the form of knowledge, understanding, skills, expertise, and empowerment, if we invest our Spiritual Currencies wisely.
</p>
</div>
</div>
<div id="outline-container-orgcd8236d" class="outline-2">
<h2 id="orgcd8236d">29 ways to stay creative</h2>
<div class="outline-text-2" id="text-orgcd8236d">
<ol class="org-ol">
<li>Make lists</li>
<li>Carry a <b>notebook</b> everywhere</li>
<li><b>Try free writing</b></li>
<li><b>Get away</b> from the computer</li>
<li>Quit beating <b>yourself</b> up</li>
<li>Take <b>breaks</b></li>
<li><b>Sing</b> in the shower</li>
<li>Drink <b>coffee</b></li>
<li><b>Listen</b> to new music</li>
<li><b>Be open</b></li>
<li>Surround yourself with <b>creative people</b></li>
<li>Get <b>feedback</b></li>
<li><b>Collaborate</b></li>
<li><b>Don't give up</b></li>
<li>Practice, <b>practice</b> and practice</li>
<li>Allow yourself to make <b>mistakes</b></li>
<li>Go somewhere <b>new</b></li>
<li>Count your <b>blessings</b></li>
<li>Get lots of <b>rest</b></li>
<li>Take <b>risks</b></li>
<li><b>BREAK THE RULES</b></li>
<li><b>Don't force it</b></li>
<li>Read a page of <b>the dictionary</b></li>
<li>Create a <b>framework</b></li>
<li>Stop trying to be someone else's <b>perfect</b></li>
<li>Got an <b>idea</b>? Write it down!</li>
<li><b>Clean</b> your work place</li>
<li><b>HAVE FUN</b></li>
<li><b>FINISH</b> something</li>
</ol>
</div>
</div>
<div id="outline-container-org3d3fc1d" class="outline-2">
<h2 id="org3d3fc1d">FRIENDS</h2>
<div class="outline-text-2" id="text-org3d3fc1d">
<blockquote>
<p>
You are the average of the <b>five people</b> you associate with most, so do not <b>underestimate</b> the effects of your pessimistic, unambitious, or disorganized friends. If someone isn't <b>making you stronger</b>, they're making you weaker.
</p>

<p>
&#x2013; Tim Ferriss
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org2d4abd8" class="outline-2">
<h2 id="org2d4abd8">TO DO</h2>
<div class="outline-text-2" id="text-org2d4abd8">
<ul class="org-ul">
<li>THINK POSITIVELY</li>
<li>NETWORK WELL</li>
<li>EXERCISE DAILY</li>
<li>EAT HEALTHLY</li>
<li>WORK HARD</li>
<li>STAY STRONG</li>
<li>BUILD FAITH</li>
<li>WORRY LESS</li>
<li>READ MORE</li>
<li>BE HAPPY</li>
<li>VOLUNTEER FREELY</li>
<li>RELAX OFTEN</li>
<li>LOVE ALWAYS</li>
<li>LIVE FOREVER</li>
</ul>
</div>
</div>
<div id="outline-container-org1714fb5" class="outline-2">
<h2 id="org1714fb5">Educate yourself</h2>
<div class="outline-text-2" id="text-org1714fb5">
<p>
When a question about a certain topic pops up, google it. Watch movies and documentaries. When something sparks your interest, read about it. Read read read. Study, learn stimulate your brain. Don't just rely on the school system, educate that beautiful mind of yours..
</p>
</div>
</div>
<div id="outline-container-org3af2971" class="outline-2">
<h2 id="org3af2971">Unhelpful thinking styles</h2>
<div class="outline-text-2" id="text-org3af2971">
</div>
<div id="outline-container-org17ead50" class="outline-3">
<h3 id="org17ead50">All or nothing thinking</h3>
<div class="outline-text-3" id="text-org17ead50">
<p>
Sometimes called "black and white thinking"
</p>

<p>
If I'm not perfect I have failed.
</p>

<p>
Either I do it right or not at all
</p>
</div>
</div>
<div id="outline-container-org7f27ef6" class="outline-3">
<h3 id="org7f27ef6">Mental filter</h3>
<div class="outline-text-3" id="text-org7f27ef6">
<p>
Only paying attention to certain types of evidence.
</p>

<p>
Noticing our failures but not seeking successes
</p>
</div>
</div>
<div id="outline-container-org655cd0c" class="outline-3">
<h3 id="org655cd0c">Jumping to conclusions</h3>
<div class="outline-text-3" id="text-org655cd0c">
<p>
There's two key types of jumping to conclusions
</p>
<ul class="org-ul">
<li><b>Mind reading:</b> Imagining we know what others are thinking</li>
<li><b>Fortune telling:</b> Predicting the future</li>
</ul>
</div>
</div>
<div id="outline-container-org86d7216" class="outline-3">
<h3 id="org86d7216">Emotional reasoning</h3>
<div class="outline-text-3" id="text-org86d7216">
<p>
Assuming that because you feel a certain way what we think myst be true
</p>
<blockquote>
<p>
I feel embarrassed so I must be an idiot
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org0d8a442" class="outline-3">
<h3 id="org0d8a442">Labeling</h3>
<div class="outline-text-3" id="text-org0d8a442">
<p>
Assigning labels to ourselves or other people
</p>
</div>
</div>
<div id="outline-container-org9080c01" class="outline-3">
<h3 id="org9080c01">Over-generalizing</h3>
<div class="outline-text-3" id="text-org9080c01">
<p>
Seeing a pater based upon a single event, or being overly broad in the conclusions we draw.
</p>
</div>
</div>
<div id="outline-container-org6edff48" class="outline-3">
<h3 id="org6edff48">Disqualifying the positive</h3>
<div class="outline-text-3" id="text-org6edff48">
<p>
Discounting the good things that happened or that you have done for some reason or another
</p>
<blockquote>
<p>
That doesn't matter
</p>
</blockquote>
</div>
</div>
