posts/copied/20250607-4chan_forMyAnons_pack.org
** Magnification (catastrophising) and Minimization
Blowing things out of proportion (catastrophising), or inappropriately shrinking something to make it seem less important.
** Should, must...
Using critical words like "should", "must" or "ought" can make us feel guilty, or like we already failed

If we apply "shoulds" to other people the result is often frustration.
** "This is my fault"
Blaming yourself or taking responsibility for something that wasn't your completely your fault

Conversely, blaming other people for something that was your fault.
* Why Only Few Succeed
- They know their *WHY*
- They value their *SLEEP*
- They live below *THEIR MEANS*
- They focus on *EDUCATION*
- They prioritize their *HEALTH*
* Why People Give Up
- Expect fast results
- Stop believing in themselves
- Get stuck in the past
- Dwell on mistakes
- Fear the future
- Resist change
- Give up their power
- Believe in their weakness
- Feel the world owes them something
- Fear failure more than desire success
- Never visualize what is possible
- Feel they have something to lose
- Overwork
- Assume their problems are unique
- See failure as the signal to turn back
- Feel sorry for themselves
# Sun Jan 21 07:42:55 2024
* VERDADES QUE VOCE NAO QUER LER
1. Você não alcança seus *OBJETIVOS* porque não tem disciplina.
2. Se suas metas não tem um *MÉTODO*, elas são apenas sonhos.
3. Ter um *PLANO B* nao vai te levar a lugar algum.
4. Se você esperar as condições perfeitas, *NUNCA* vai comecar.
5. Ideias não servem de *NADA* se não forem colocadas em prática.
6. A mudança que você quer está na *DECISAO* que você não toma.
* ENTENDENDO SUAS HABILIDADES
** Aprecie seu esforço.
Porque você está disposto a dar uma boa olhada em onde você já é forte e onde você pode melhorar, você já é uma pessoa forte. É preciso coragem para sentar e fazer esse trabalho. Dê um tapinha nas costas do seu eu incrível e lembre-se de que você é uma pessoa incrível.
** Anote o que você faz
Para identificar seus pontos fortes e fracos, pense nas atividades das quais você mais participa ou das quais tem mais prazer. Passe uma semana ou mais anotando todas as atividades que você faz ao longo de um determinado dia, classificando-as de um a cinco, dependendo do quanto você gosta de fazer ou participar delas.
** Reflita sobre seus valores
Às vezes, pode ser difícil identificar nossos pontos fortes e fracos porque não dedicamos tempo para esclarecer nossos valores fundamentais. Essas são as crenças que moldam como você pensa sobre si mesmo, os outros e o mundo ao seu redor. Eles são fundamentais para a sua forma de encarar a vida. Tirar algum tempo para identificar seus valores o ajudará a decidir se os aspectos de sua vida são pontos fortes ou fracos para você, independentemente do que os outros possam sentir sobre eles.
** Examine suas respostas para temas e padrões
Depois de refletir sobre seus valores, examine as respostas para coisas que podem se repetir. Por exemplo, talvez você admire Bill Gates e Richard Branson por seu espírito empreendedor e criatividade. Isso sugere que você pode valorizar Ambição, Competição e Ingenuidade. Talvez você mude a pobreza em sua comunidade para que todos tenham casa e comida. Isso sugere que você pode valorizar a Comunidade, Ajudando a Sociedade ou Fazendo a Diferença. Você pode ter vários valores fundamentais.
** Determine se sua vida se alinha com seus valores
Às vezes, podemos sentir que temos uma fraqueza em uma área específica quando nossas vidas não se alinham com nossos valores fundamentais, por qualquer motivo. Viver uma vida alinhada com seus valores é chamado de vida "congruente com os valores" e pode levar a maiores sentimentos de satisfação e sucesso.
** Considere os significados situacionais
Pense sobre o que constitui pontos fortes ou fracos em relação às convenções sociais ou costumes em seu contexto local. As convenções sociais são um conjunto de regras que governam a interação interpessoal que foram estabelecidas como funcionais dentro de uma determinada área geológica ou cultura, esperançosamente para ajudar a manter limites sociais saudáveis. Saber como eles diferem dependendo de onde você mora pode ajudá-lo a determinar o que pode ser visto como um ponto forte ou fraco nessa localização geográfica específica.
