copied/20250607-4chan_forMyAnons_pack.html
<div id="outline-container-org2630c35" class="outline-3">
<h3 id="org2630c35">Magnification (catastrophising) and Minimization</h3>
<div class="outline-text-3" id="text-org2630c35">
<p>
Blowing things out of proportion (catastrophising), or inappropriately shrinking something to make it seem less important.
</p>
</div>
</div>
<div id="outline-container-org4dfdbdb" class="outline-3">
<h3 id="org4dfdbdb">Should, must&#x2026;</h3>
<div class="outline-text-3" id="text-org4dfdbdb">
<p>
Using critical words like "should", "must" or "ought" can make us feel guilty, or like we already failed
</p>

<p>
If we apply "shoulds" to other people the result is often frustration.
</p>
</div>
</div>
<div id="outline-container-org1286538" class="outline-3">
<h3 id="org1286538">"This is my fault"</h3>
<div class="outline-text-3" id="text-org1286538">
<p>
Blaming yourself or taking responsibility for something that wasn't your completely your fault
</p>

<p>
Conversely, blaming other people for something that was your fault.
</p>
</div>
</div>
</div>
<div id="outline-container-org47a45f4" class="outline-2">
<h2 id="org47a45f4">Why Only Few Succeed</h2>
<div class="outline-text-2" id="text-org47a45f4">
<ul class="org-ul">
<li>They know their <b>WHY</b></li>
<li>They value their <b>SLEEP</b></li>
<li>They live below <b>THEIR MEANS</b></li>
<li>They focus on <b>EDUCATION</b></li>
<li>They prioritize their <b>HEALTH</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgbc5c2e9" class="outline-2">
<h2 id="orgbc5c2e9">Why People Give Up</h2>
<div class="outline-text-2" id="text-orgbc5c2e9">
<ul class="org-ul">
<li>Expect fast results</li>
<li>Stop believing in themselves</li>
<li>Get stuck in the past</li>
<li>Dwell on mistakes</li>
<li>Fear the future</li>
<li>Resist change</li>
<li>Give up their power</li>
<li>Believe in their weakness</li>
<li>Feel the world owes them something</li>
<li>Fear failure more than desire success</li>
<li>Never visualize what is possible</li>
<li>Feel they have something to lose</li>
<li>Overwork</li>
<li>Assume their problems are unique</li>
<li>See failure as the signal to turn back</li>
<li>Feel sorry for themselves</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3838db" class="outline-2">
<h2 id="orgd3838db">Maybe not from 4Chan</h2>
<div class="outline-text-2" id="text-orgd3838db">
</div>
<div id="outline-container-org6cc8c18" class="outline-3">
<h3 id="org6cc8c18">VERDADES QUE VOCE NAO QUER LER</h3>
<div class="outline-text-3" id="text-org6cc8c18">
<ol class="org-ol">
<li>Você não alcança seus <b>OBJETIVOS</b> porque não tem disciplina.</li>
<li>Se suas metas não tem um <b>MÉTODO</b>, elas são apenas sonhos.</li>
<li>Ter um <b>PLANO B</b> nao vai te levar a lugar algum.</li>
<li>Se você esperar as condições perfeitas, <b>NUNCA</b> vai comecar.</li>
<li>Ideias não servem de <b>NADA</b> se não forem colocadas em prática.</li>
<li>A mudança que você quer está na <b>DECISAO</b> que você não toma.</li>
</ol>
</div>
</div>
<div id="outline-container-org7dbd02a" class="outline-3">
<h3 id="org7dbd02a">ENTENDENDO SUAS HABILIDADES</h3>
<div class="outline-text-3" id="text-org7dbd02a">
</div>
<div id="outline-container-org97de5da" class="outline-4">
<h4 id="org97de5da">Aprecie seu esforço.</h4>
<div class="outline-text-4" id="text-org97de5da">
<p>
Porque você está disposto a dar uma boa olhada em onde você já é forte e onde você pode melhorar, você já é uma pessoa forte. É preciso coragem para sentar e fazer esse trabalho. Dê um tapinha nas costas do seu eu incrível e lembre-se de que você é uma pessoa incrível.
</p>
</div>
</div>
<div id="outline-container-org6f008d9" class="outline-4">
<h4 id="org6f008d9">Anote o que você faz</h4>
<div class="outline-text-4" id="text-org6f008d9">
<p>
Para identificar seus pontos fortes e fracos, pense nas atividades das quais você mais participa ou das quais tem mais prazer. Passe uma semana ou mais anotando todas as atividades que você faz ao longo de um determinado dia, classificando-as de um a cinco, dependendo do quanto você gosta de fazer ou participar delas.
</p>
</div>
</div>
<div id="outline-container-org3eb5042" class="outline-4">
<h4 id="org3eb5042">Reflita sobre seus valores</h4>
<div class="outline-text-4" id="text-org3eb5042">
<p>
Às vezes, pode ser difícil identificar nossos pontos fortes e fracos porque não dedicamos tempo para esclarecer nossos valores fundamentais. Essas são as crenças que moldam como você pensa sobre si mesmo, os outros e o mundo ao seu redor. Eles são fundamentais para a sua forma de encarar a vida. Tirar algum tempo para identificar seus valores o ajudará a decidir se os aspectos de sua vida são pontos fortes ou fracos para você, independentemente do que os outros possam sentir sobre eles.
</p>
</div>
</div>
<div id="outline-container-org3c13680" class="outline-4">
<h4 id="org3c13680">Examine suas respostas para temas e padrões</h4>
<div class="outline-text-4" id="text-org3c13680">
<p>
Depois de refletir sobre seus valores, examine as respostas para coisas que podem se repetir. Por exemplo, talvez você admire Bill Gates e Richard Branson por seu espírito empreendedor e criatividade. Isso sugere que você pode valorizar Ambição, Competição e Ingenuidade. Talvez você mude a pobreza em sua comunidade para que todos tenham casa e comida. Isso sugere que você pode valorizar a Comunidade, Ajudando a Sociedade ou Fazendo a Diferença. Você pode ter vários valores fundamentais.
</p>
</div>
</div>
<div id="outline-container-org9897188" class="outline-4">
<h4 id="org9897188">Determine se sua vida se alinha com seus valores</h4>
<div class="outline-text-4" id="text-org9897188">
<p>
Às vezes, podemos sentir que temos uma fraqueza em uma área específica quando nossas vidas não se alinham com nossos valores fundamentais, por qualquer motivo. Viver uma vida alinhada com seus valores é chamado de vida "congruente com os valores" e pode levar a maiores sentimentos de satisfação e sucesso.
</p>
</div>
</div>
<div id="outline-container-org3789452" class="outline-4">
<h4 id="org3789452">Considere os significados situacionais</h4>
<div class="outline-text-4" id="text-org3789452">
<p>
Pense sobre o que constitui pontos fortes ou fracos em relação às convenções sociais ou costumes em seu contexto local. As convenções sociais são um conjunto de regras que governam a interação interpessoal que foram estabelecidas como funcionais dentro de uma determinada área geológica ou cultura, esperançosamente para ajudar a manter limites sociais saudáveis. Saber como eles diferem dependendo de onde você mora pode ajudá-lo a determinar o que pode ser visto como um ponto forte ou fraco nessa localização geográfica específica.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
See the source code <a href="https://github.com/thisago/blog">here</a>.
</div>
</body>
</html>
